{"id": 125815, "sentence": "* Drivers: We collect your device’s precise location when you open and use the app, including while the app is running in the background.", "rewrite": "Drivers: We collect your device’s precise location when you open and use the app."}
{"id": 178924, "sentence": "We also collect and store your data each time you interact with us,for example, when you use in-app support to communicate with us.", "rewrite": "We also collect and store your data each time you interact with us."}
{"id": 173582, "sentence": "The system needs to temporarily store the IP address in order to enable the provision of the Services to the user's computer.", "rewrite": "The system needs to temporarily store the IP address in order to enable the provision of the Services to the user's computer."}
{"id": 172991, "sentence": "Information you store in, or contribute to, a public repository, provide for use in connection with a Community Feature or make otherwise publicly available through the Service will be collected by GitHub as described in this Privacy Statement.", "rewrite": "Information you store in, or contribute to, a public repository, provide for use in connection with a Community Feature or make otherwise publicly available through the Service will be collected by GitHub as described in this Privacy Statement."}
{"id": 176875, "sentence": "* whether we collect and use your personal information;", "rewrite": "You have the right to know: whether we collect and use your personal information;"}
{"id": 155630, "sentence": "**Categories of sources of personal data** This includes information you provide us, that we collect and infer when you use our products and services and provided or purchased from other sources.", "rewrite": "Categories of sources of personal data include information you provide us, that we collect and infer and provided or purchased from other sources."}
{"id": 150974, "sentence": "* If you have opted in to use Waze Carpool, we use your information to match you with riders and/or drivers to help you find a ride.", "rewrite": "If you have opted in to use Waze Carpool, we use your information to match you with riders and/or drivers to help you find a ride."}
{"id": 158088, "sentence": "Followers you approve are able to see your workout streaming history.", "rewrite": "Followers you approve are able to see your workout streaming history."}
{"id": 141359, "sentence": "If we become aware that a child under age 18 has provided us with personal data without parental consent, we will take steps to remove such personal data.", "rewrite": "If we become aware that a child under age 18 has provided us with personal data without parental consent, we will take steps to remove such personal data."}
{"id": 151495, "sentence": "Once Mintegral collects this information, it becomes the controller of that information, as that term is recognized by privacy laws.", "rewrite": "Once Mintegral collects this information, it becomes the controller of that information."}
{"id": 173440, "sentence": "HEALOW (or service providers on HEALOW’s behalf) may collect information from visits to the Site through the use of “Web Beacons.” Web Beacons are web page elements which may employ cookie technology that enable HEALOW to record data about visits to or transactions made on the Site.", "rewrite": "HEALOW (or service providers on HEALOW’s behalf) may collect information from visits to the Site through the use of “Web Beacons.” Web Beacons are web page elements which may employ cookie technology that enable HEALOW to record data about visits to or transactions made on the Site."}
{"id": 139718, "sentence": "The **EU Representative** of our US-based NBCUniversal Affiliates is Universal Studios International B.V., Moermanskkade 421, 1013 BC Amsterdam, The Netherlands.", "rewrite": "The **EU Representative** of our US-based NBCUniversal Affiliates is Universal Studios International B.V., Moermanskkade 421, 1013 BC Amsterdam, The Netherlands."}
{"id": 170304, "sentence": "If you are an authorized agent acting on behalf of a Californian player to communicate with us or to exercise a privacy right discussed above, you must be able to demonstrate that you have the requisite authorization to act on behalf of the player, and have sufficient access to that player’s laptop, desktop, or mobile device to exercise that player’s right digitally.", "rewrite": "If you are an authorized agent,  you must demonstrate requisite authorization to act on behalf of the player"}
{"id": 155337, "sentence": "* Opt-out of the sale or sharing of your personal information (including targeted advertising)", "rewrite": "You have the right to opt-out of the sale or sharing of your personal information."}
{"id": 139644, "sentence": "Please note that if you have a legally recognized browser-based opt out preference signal turned on via your device browser (such as Global Privacy Control), we recognize such preference in accordance and to the extent required by applicable law.", "rewrite": "If you have a legally recognized browser-based opt out preference signal turned on via your device browser, we recognize such preference to the extent required by applicable law."}
{"id": 140356, "sentence": "​· Managing your information and accounts;", "rewrite": "Managing your information and accounts;"}
{"id": 178295, "sentence": "We use **administrative, technical, and physical safeguards** to protect your personal data, taking into account the nature of the personal data and the processing, and the threats posed.", "rewrite": "We use administrative, technical, and physical safeguards to protect your personal data, considering the nature of the personal data and the processing, and the threats."}
{"id": 128856, "sentence": "However, non-personally identifiable visitor information may be provided to other parties for marketing, advertising, or other uses.", "rewrite": "However, non-personally identifiable visitor information may be provided to other parties."}
{"id": 162127, "sentence": "In general, we keep your information for as long as necessary to achieve the purposes stated in this Policy or to comply with the applicable law.", "rewrite": "we keep your information for as long as necessary to achieve certain purposes or to comply with the applicable law."}
{"id": 178949, "sentence": "h. Chat Data: if you enable chat services (audio or text) then we will process such data in order to deliver your messages to other users;", "rewrite": "We use Chat Data to deliver your messages to other users."}
{"id": 152898, "sentence": "Should you allow your minor child to use your account (whether through your profile or a Bible App for Kids profile), you shall be solely responsible for providing supervision of the minor’s use of YouVersion and assume full responsibility for the interpretation and use of any information or suggestions provided through YouVersion.", "rewrite": "Should you allow your minor child to use your account, you shall be solely responsible for providing supervision of the minor’s use of YouVersion and assume full responsibility for the interpretation and use of any information or suggestions provided through YouVersion."}
{"id": 167487, "sentence": "Please note that we may contact you with information about products, services, offers, promotions, rewards, and events offered by us and others via third- party platforms (like social media).", "rewrite": "We may contact you with information about products, services, offers, promotions, rewards, and events offered by us and others via third-party platforms."}
{"id": 158211, "sentence": "We do not knowingly collect personal information directly from children who do not meet the minimum age requirement applicable in your jurisdiction, and if you do not meet the age requirements as specified in our Terms of Service.", "rewrite": "If you do not meet the age requirements set forth in our Terms of Service, we will not knowingly collect personal information directly from you."}
{"id": 184258, "sentence": "In fulfilling these types of promotions, we may share your name and other information in connection with fulfilling the incentive.", "rewrite": "In fulfilling these types of promotions, we may share your name and other information in connection with fulfilling the incentive."}
{"id": 155733, "sentence": "* Marketing data, such as your preferences for receiving our marketing communications and details about your engagement with them.", "rewrite": "We collect your marketing data."}
{"id": 152872, "sentence": "If you have provided us with personal information and wish to make such a request under a specific region’s law, include the phrase “[Your State/Country] Privacy Request” in the subject line of your request and send your request via email to [help@youversion.com](mailto:help@youversion.com) or via mail to YouVersion, attn.", "rewrite": "If you have provided us with personal information and wish to make such a request under a specific region’s law,you can contact via email to [help@youversion.com](mailto:help@youversion.com) or via mail to YouVersion, attn.: YouVersion Support, 4600 E. 2nd St., Edmond, Oklahoma 73034."}
{"id": 155912, "sentence": "* Identifiers, such as name, display name, postal address, unique personal identifier, online identifier, IP address, email address, username, or other similar identifiers.", "rewrite": "We have collected identifiers."}
{"id": 147856, "sentence": "The legal ground will depend on the purpose for which we process your personal information and the data protection law that applies with respect to our activities in your jurisdiction.", "rewrite": "The legal ground will depend on the purpose for which we process your personal information and the applicable data protection law."}
{"id": 160717, "sentence": "This information is used to recognize and solve a problem you are trying to solve.", "rewrite": "This information is used to recognize and solve your problem."}
{"id": 152342, "sentence": "In many cases, the information we collect using cookies and other tools is only used in a non-identifiable way, without reference to Personal Data.", "rewrite": "In many cases, the information we collect using tools is only used in a non-identifiable way."}
{"id": 166086, "sentence": "* Device permissions: Your mobile device has controls that let you grant or deny permission for certain types of data collection or notifications.", "rewrite": "You can grant or deny permission for certain data collection or notifications on your mobile device."}
{"id": 148309, "sentence": "For servers, those permissions are set by server owners or admins.", "rewrite": "The permissions are set by server owners or admins."}
{"id": 162035, "sentence": "For example, we use your language preferences and country location to display the correct language and time zone in the Services.", "rewrite": "we use your language preferences and country location to display the correct language and time zone."}
{"id": 146709, "sentence": "Our legal basis is performance of a contract, legitimate interests or consent depending on the particular case to keep our users updated about our Services and our new features in accordance with your preference, and to continue to improve the Services we offer.", "rewrite": "We depend on the particular case to keep our users updated about our Services and our new features in accordance with your preference, and to continue to improve the Services we offer."}
{"id": 140715, "sentence": "Your continued access to or use of the Platform after the date of the updated policy constitutes your acceptance of the updated policy.", "rewrite": "Your continued access to or use of the Platform after the date of the updated policy constitutes your acceptance of the updated policy."}
{"id": 158240, "sentence": "We may collect the following types of personal information about you when you use the Services, including by creating a user profile on the Sites or register to become a Flip Creator, post a flip video, indicate that you like a product or a Flip video clip, purchase or return a product, submit comments about a product or a Flip video, sign onto our Services through a social media platform, or redeem Rewards earned or other compensation associated with your use of our Sites, and otherwise communicate with us.", "rewrite": "We may collect the following types of personal information about you when you use the Services, including by creating a user profile on the Sites or register to become a Flip Creator, post a flip video, indicate that you like a product or a Flip video clip, purchase or return a product, submit comments about a product or a Flip video, sign onto our Services through a social media platform, or redeem Rewards earned or other compensation associated with your use of our Sites, and otherwise communicate with us."}
{"id": 149019, "sentence": "We share your information with Event Partner(s) – such as the artist, promoter, record label or venue – as well as other third parties associated with the service provided.", "rewrite": "We share your information with Event Partner(s) – such as the artist, promoter, record label or venue – as well as other third parties associated with the service provided."}
{"id": 129687, "sentence": "• Obtaining verifiable parental consent, as necessary;", "rewrite": "• Obtaining verifiable parental consent, as necessary;"}
{"id": 178981, "sentence": "d. Open ID: stored for the lifetime of your use of the Game, until account deletion in accordance with your request, upon which it will be deleted within 15 days; Where you do not request account deletion, such data will be retained for 1 year after the Game is shut down, before it is deleted.", "rewrite": "Open ID is stored until account deletion under your request; or such data will be retained for 1 year after the Game is shut down."}
{"id": 178022, "sentence": "We may use this information to fill in your User Profile or connect you with your social networking service friends who also use the Services.", "rewrite": "We may use the information to fill in your User Profile or connect you with your social networking service friends."}
{"id": 128833, "sentence": "Visitors who register or participate in other site features such as marketing programs and ‘members-only’ content will be given a choice whether they would like to be on our e-mail list and receive e-mail communications from us.", "rewrite": "Visitors who register or participate in other site features will be given a choice whether to be on our e-mail list and to receive e-mail communications from us or not."}
{"id": 166119, "sentence": "We might change this privacy notice at any time.", "rewrite": "We might change this privacy notice."}
{"id": 162095, "sentence": "You can also click on the AdChoices logo within an advertisement (where available).", "rewrite": "You can also click on the AdChoices logo within an advertisement."}
{"id": 178502, "sentence": "Children under the age of 13, or equivalent minimum age in the relevant jurisdiction, are not permitted to create their own Apple IDs, unless their parent provided verifiable consent or as part of the child account creation process in Family Sharing or they have obtained a Managed Apple ID account (where available) through their school.", "rewrite": "Children under the age of 13, or equivalent minimum age in the relevant jurisdiction, are not permitted to create their own Apple IDs, unless with parental consent or as part of the child account creation process in Family Sharing or with a Managed Apple ID account  through their school."}
{"id": 148735, "sentence": "If you are a California or Virginia resident, you may be able to exercise additional rights.", "rewrite": "If you are a California or Virginia resident, you may be able to exercise additional rights."}
{"id": 157316, "sentence": "If you wish to obtain a copy of Personal Information held by us concerning you, please refer to Section 11, above.", "rewrite": "If you wish to obtain a copy of Personal Information held by us concerning you, please refer to Section 11, above."}
{"id": 160758, "sentence": "* To service providers, such as data storage service providers, which enable us to provide the Service to you; * To our business partners, such as advertising partners, in compliance with applicable laws; * To public authorities, such as law enforcement, if we are legally required to do so or if we need to protect our rights or the rights of third parties; * To our subsidiaries and affiliates; or a subsequent owner, co-owner or operator of the Service and their advisors in connection with a corporate merger, consolidation, restructuring, or the sale of substantially all of our stock and/or assets, or in connection with bankruptcy proceedings, or other corporate reorganization, in accordance with this Privacy Policy; * To our technology partners, such as machine vision technology partners; and * To other third parties, with your consent or as otherwise required or permitted by law.", "rewrite": "We may disclose personal data you provide * To service providers; * To our business partners; * To public authorities; * To our subsidiaries and affiliates; or a subsequent owner, co-owner or operator of the Service and their advisors in connection with a corporate merger, consolidation, restructuring, or the sale of substantially all of our stock and/or assets, or in connection with bankruptcy proceedings, or other corporate reorganization; * To our technology partners; and * To other third parties, with your consent or as otherwise required or permitted by law."}
{"id": 167975, "sentence": "You can also submit a request to contact Grindr's EEA and UK DPO through our website [here](https://help.grindr.com/hc/en- us/requests/new?ticket_form_id=360006692913&tf_360056453953=form__privacy_request__eea_dpo).", "rewrite": "contact Grindr's EEA and UK DPO through our website."}
{"id": 169524, "sentence": "The categories of personal information we collect include the following:", "rewrite": "categories of personal information"}
{"id": 132392, "sentence": "In some circumstances we need your information to perform our contract with you or to provide products and services, such as payment details and, on occasion, credit checking information.", "rewrite": "To perform our contract with you or to provide products and services, we need your information, including payment details and credit checking information."}
{"id": 153188, "sentence": "We collect minimal information that can be used to identify you by default.", "rewrite": "We collect minimal information that can be used to identify you by default."}
{"id": 140302, "sentence": "We might also record your gameplay, (including your button inputs), and replay it to you or other Users or use it to improve our Services and prevent fraud.", "rewrite": "We might also record your gameplay, (including your button inputs), and replay it to you or other Users or use it to improve our Services and prevent fraud."}
{"id": 189411, "sentence": "We use various technologies to collect and store information, including [cookies](privacy?hl=en#footnote-cookies), [pixel tags](privacy?hl=en#footnote-pixel), local storage, such as [browser web storage](privacy?hl=en#footnote-browser-storage) or [application data caches](privacy?hl=en#footnote-application-data-cache), databases, and [server logs](privacy?hl=en#footnote-server-logs).", "rewrite": "We use various technologies to collect and store information, including [cookies](privacy?hl=en#footnote-cookies), [pixel tags](privacy?hl=en#footnote-pixel), local storage, such as [browser web storage](privacy?hl=en#footnote-browser-storage) or [application data caches](privacy?hl=en#footnote-application-data-cache), databases, and [server logs](privacy?hl=en#footnote-server-logs)."}
{"id": 171036, "sentence": "### 2\\.Right to rectification", "rewrite": "Right to rectification"}
{"id": 127578, "sentence": "The extent of Personal Data required about a participant may vary depending on the Services you are using to send or request money.", "rewrite": "The extent of Personal Data required about a participant may vary depending on the Services."}
{"id": 173854, "sentence": "* the Controller no longer needs the personal data for the purposes of the processing, but you need this data for the establishment, exercise or defence of legal claims; or * you have objected to processing in accordance with Art.", "rewrite": "the Controller no longer needs the personal data for the purposes of the processing, but you need this data for the establishment, exercise or defence of legal claims; or * you have objected to processing in accordance with Art."}
{"id": 163982, "sentence": "If you do not accept our cookies, you may experience some inconvenience in your use of our Site.", "rewrite": "If you do not accept our cookies, you may experience some inconvenience in your use of our Site."}
{"id": 158519, "sentence": "In order to exercise your choice as a Virginia resident, please contact us at [support@get-headway.com](mailto:support@get-headway.com) with the subject line “Virginia Do Not Sell Request”.", "rewrite": "In order to exercise your choice as a Virginia resident, please contact us at [support@get-headway.com] with the subject line “Virginia Do Not Sell Request”"}
{"id": 160364, "sentence": "· Publish stories, comments, photos, and other information posted in our interactive online features;", "rewrite": "We may use the information to publish stories, comments, photos, and other information posted in our interactive online features."}
{"id": 126437, "sentence": "When Cross-Play is enabled and you play with someone on another platform, that other platform may receive your platform's ID (such as Xbox Gamertag, or Online ID of your account for PlayStation™Network) along with other information necessary to enable Cross-Play.", "rewrite": "The other platform may receive information necessary to enable Cross-Play when Cross-Play is enabled and you play with someone on another platform"}
{"id": 140591, "sentence": "(“Cookies”) to automatically collect information, measure and analyze how you use the Platform, including which pages you view most often and how you interact with content, enhance your experience using the Platform, improve the Platform, provide you with advertising, and measure the effectiveness of advertisements and other content.", "rewrite": "(“Cookies”) to automatically collect information, measure and analyze how you use the Platform, including which pages you view most often and how you interact with content, enhance your experience using the Platform, improve the Platform, provide you with advertising, and measure the effectiveness of advertisements and other content."}
{"id": 148343, "sentence": "We also enforce technical and administrative access controls to limit which of our employees and contractors have access to nonpublic personal information.", "rewrite": "We also enforce technical and administrative access controls to limit our employees and contractors."}
{"id": 140623, "sentence": "* To understand how you use the Platform, including across your devices.", "rewrite": "To understand how you use the Platform, including across your devices."}
{"id": 147972, "sentence": "We collect several different types of information for various purposes to provide and improve our Service to you.", "rewrite": "We collect several different types of information for various purposes."}
{"id": 160046, "sentence": "You have a right in certain circumstances to stop us processing Information other than for storage purposes.", "rewrite": "You have a right in certain circumstances to stop us processing Information other than for storage purposes."}
{"id": 132615, "sentence": "Typically, these promotional offerings are limited in quantity and geographic reach and targeted to specific demographic audiences.", "rewrite": "Typically, these promotional offerings are limited in quantity and geographic reach and targeted to specific demographic audiences."}
{"id": 161508, "sentence": "You may also notice changes in your X experience or limitations in your ability to access certain features depending on the settings you’ve adjusted.", "rewrite": "Changes in your X experience or limitations in your ability to access certain features depend on the settings you’ve adjusted."}
{"id": 175340, "sentence": "We may email you from time to time to notify you of any updates and promotional opportunities that may benefit you.", "rewrite": "We may email you from time to time to notify you of any updates and promotional opportunities that may benefit you."}
{"id": 186718, "sentence": "Rectification or Correction: to correct your personal information where it is inaccurate, incomplete, or outdated.", "rewrite": "The right to correct your personal information where it is inaccurate, incomplete, or outdated."}
{"id": 152797, "sentence": "Because the purpose of these polls and surveys may vary, we will provide details related to the disclosure and use of personal information in relation to any poll or survey prior to you providing any information.", "rewrite": "We will provide details related to the disclosure and use of personal information in relation to any poll or survey prior to you providing any information."}
{"id": 140760, "sentence": "* When you choose to participate in our promotions, events or contests, we collect the information that you use to register or enter.", "rewrite": "When you choose to participate in our promotions, events or contests, we collect the information that you use to register or enter."}
{"id": 164925, "sentence": "**Information You Choose to Share** You have the option of sharing your personal information with the public or with third parties.", "rewrite": "You can share your personal information with the public or with third parties."}
{"id": 182465, "sentence": "** For example, we use your information, including profile, search, likes, and purchase histories, to suggest items, closets, offers, features, or events that we think you might enjoy.", "rewrite": "we use your information to suggest items, closets, offers, features, or events that you might enjoy."}
{"id": 140341, "sentence": "These features may collect your IP address and which page you are visiting on our Services, and may set a cookie to enable the feature to function properly.", "rewrite": "Social media interaction buttons may collect your IP address and which page you are visiting on our Services, and may set a cookie to enable the feature to function properly."}
{"id": 131132, "sentence": "* **Content and Context from Meetings, Webinars, Messaging, and Other Collaborative Features:** Content generated in meetings, webinars, or messages that are hosted on Zoom products and services (“Customer Content”), which may include audio, video, in-meeting messages, in-meeting and out-of-meeting whiteboards, chat messaging content, transcriptions, transcript edits and recommendations, written feedback, responses to polls and Q&A, and files, as well as related context, such as invitation details, meeting or chat name, or meeting agenda.", "rewrite": "* **Content and Context from Meetings, Webinars, Messaging, and Other Collaborative Features:** Content generated in meetings, webinars, or messages that are hosted on Zoom products and services (“Customer Content”), which may include audio, video, in-meeting messages, in-meeting and out-of-meeting whiteboards, chat messaging content, transcriptions, transcript edits and recommendations, written feedback, responses to polls and Q&A, and files, as well as related context, such as invitation details, meeting or chat name, or meeting agenda."}
{"id": 153327, "sentence": "You may also choose to import your Mii avatar into certain Services.", "rewrite": "You may also choose to import your Mii avatar into certain Services."}
{"id": 184327, "sentence": "For example, we and our Service Providers may use these cookies to authenticate and identify our members when they use our websites and applications so we can provide our service to them.", "rewrite": "For example, we and our Service Providers may use these cookies to authenticate and identify our members when they use our websites and applications so we can provide our service to them."}
{"id": 129553, "sentence": "If you do not agree, discontinue any use of our Platforms.", "rewrite": "You cannot continue to use our Platforms without agreement."}
{"id": 152988, "sentence": "_Secret chats_ use end-to-end encryption.", "rewrite": "_Secret chats_ use end-to-end encryption."}
{"id": 169582, "sentence": "These SDKs allow us to track our conversions, bring you advertising, and provide you with additional functionality.", "rewrite": "These SDKs allow us to track conversions, bring advertising, and provide additional functionality."}
{"id": 148297, "sentence": "We retain and use your information in connection with potential legal claims when necessary and for compliance, regulatory, and auditing purposes.", "rewrite": "We retain and use your information in connection with potential legal claims when necessary and for compliance, regulatory, and auditing purposes."}
{"id": 175143, "sentence": "We do this to better understand and serve our customers.", "rewrite": "We do this to better understand and serve our customers."}
{"id": 159950, "sentence": "We will use your Information to perform our contractual obligation towards you to allow you to create an account, play the Games (including as a guest), remember your progress, allow you to play Games with your friends and communicate with them via in-Game chat, audio, or video calls (if applicable).", "rewrite": "We will use your Information to perform our contractual obligation to allow you to create an account, play the Games, remember your progress, allow you to play Games with your friends and communicate with them."}
{"id": 169588, "sentence": "* Data brokers from which we purchase demographic data and other personal information to supplement the personal information we collect.", "rewrite": "we purchase demographic data and other personal information"}
{"id": 132257, "sentence": "If you want to opt out of services, or review or delete your information, please contact us at dpo@spinmaster.com.", "rewrite": "If you want to opt out of services, or review or delete your information, please contact us at dpo@spinmaster.com."}
{"id": 149339, "sentence": "**Access to Information and Withdrawal of Consent ** You can ask for the identification, modification or deletion of your Information by emailing us at the contact information set out below.", "rewrite": "Access to Information and Withdrawal of Consent ** You can ask for the identification, modification or deletion of your Information by emailing us at the contact information set out below."}
{"id": 126528, "sentence": "* If you opt-out of having your information shared for purposes of targeted advertising on PC and console through your EA Account, your choice will take effect for any PC and console games that you have logged into with your EA Account.", "rewrite": "Your choice will take effect for any PC and console games that you have logged into with your EA Account  if you opt-out of having your information shared for purposes of targeted advertising on PC and console."}
{"id": 152198, "sentence": "However, we do not request or intend to collect any “special categories information” such as information on health, race, religion, political opinions, sexual preferences or orientation.", "rewrite": "We do not request and do not intend to collect any \"special categories of information,\" such as information about health, race, religion, political views, sexual preferences, or sexual orientation."}
{"id": 131205, "sentence": "* **Participant List:** Information about the participants in a Zoom meeting, webinar, or chat, which may include name, display name, email address, phone number, and participant or user ID.", "rewrite": "**Participant List:** Information about the participants in a Zoom meeting, webinar, or chat, which may include name, display name, email address, phone number, and participant or user ID."}
{"id": 153440, "sentence": "We only share information about you to government or law enforcement officials or private parties when we reasonably believe necessary or appropriate: (a) to respond to claims, legal process (including subpoenas and warrants); (b) to protect our property, rights, and safety and the property, rights, and safety of a third party or the public in general; or (c) to investigate and stop any activity that we consider illegal, unethical, or legally actionable.", "rewrite": "We only share information about you to government or law enforcement officials or private parties when we reasonably believe necessary or appropriate to execution of duty."}
